SOAPRequest.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:NS2="http://spr.nvcm.net/ActualDictionaryWebService"><NS1:receiveActualDictionary xmlns:NS1="http://spr.nvcm.net/ActualDictionaryWebService"><receiveActualDictionary href="#1"/></NS1:receiveActualDictionary><NS2:receiveActualDictionary id="1" xsi:type="NS2:receiveActualDictionary"><requestGuid xsi:type="xsd:string">aa81a56c-9895-4999-ba61-4c0ae00e6eea</requestGuid></NS2:receiveActualDictionary></SOAP-ENV:Body></SOAP-ENV:Envelope>
